import requests

'''
    自定义批量执行URL
'''

param_list = [
    "2月份我不在四川", "我不在郑州这两天", "不是，山东", "我这周末不在北京", "改到2.18之后吧，过年期间不在苏州", "现在都不在盱眙呢", "周一到周五不在惠州", "我最近人不在北京", "不是，西安",
    "这几天不在烟台", "我人不在无锡", "这几天不在福州，下个星期才回来", "我这套不在南通，在安徽滁州", "不是上海的，昆山富力湾四季半岛89平的房子", "我不在成都，年后装", "不是嘉兴的，是杭州的",
    "不好意思，目前不在漳州，而且房子外租给中介公司了", "现在不在英德那边", "我人不在海南，就是想装修好了今年下半11月份去过冬，我可以发个房子平面图给你先作参考", "唉呀，我目前不在天津",
    "我出差了，这几天不在青岛，你们可以自己去量一下，之前我找了几家，可以自己去量一下的", "不是我在纽约", "不在深圳，在昆明，", "我平时都不在中山", "这个有点麻烦，这个月不在昆山。", "目前在上海工作，房子不在这边",
    "啊哈？我不在成都", "不是，房子在武汉", "不是，我是在宁波工作", "不是北京，是河北隆化县", "餐馆。不是舟山本地的沟通起来太麻烦，不考虑", "地址不是在厦门市", "房子不是武汉的", "房子不是在武汉，",
    "房子不在北京", "房子不在北京可以吗？", "房子不在广州，人在", "房子不在深圳。你们也能搞", "明天我不在上海。我要周六回来。但想跟设计师先沟通起来", "年前回老家，不在福清市区",
    "您好，我是天津的房子，不是广州这里", "上面不是说过了、吗，旧房改造装修吗，我这是北京延庆区呀，", "我不是珠海的，我是鹤山市共和镇", "我不在广州，还河南商丘", "我不在湖州哎明天", "我不在昆明，也没有人在",
    "我不在闵行，照片发你可以吗", "我不在南昌 我在杭州  ", "我不在南京，是密码锁", "我的房不在石家庄，在保定", "我的房子不在福州", "我房子在固始县城[抱拳][抱拳]不在郑州", "我过年前都不在中山",
    "我们的房子在河南开封，不在长沙", "我人又不在常州", "我现在不在家，在广东", "我暂时不在合肥", "行 我最近不在成都 我27.28回来 到时候提前联系", "因为我们不在成都", "暂时不在长沙", "这周不在武汉 "
]


def call_http(param):
    url = "http://192.168.41.112:40015/nlp/nerAndcategory"
    data = {
        "bussinessKey": "intelligentPlatform",
        "bussinessId": "111111",
        "content": param,
        "currentTime": "123"
    }
    res = requests.post(url=url, json=data)

    return res.json()


if __name__ == '__main__':

    for param in param_list:
        # print("param=", param)
        resJson = call_http(param)
        print("", resJson)
